Revit 2024 API
FabricationHostedInfo Members
The FabricationHostedInfo type exposes the following members.
Methods
Name | Description
DisconnectFromHost
 Disconnects the part from the host.
Dispose
Releases all resources used by the FabricationHostedInfo
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetBearerCenterline
 Gets the centerline of the bearer. The method is applicable only for bearer hanger.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
PlaceOnHost(ElementId, Connector, Double)
 Places the part on the specified host.
PlaceOnHost(ElementId, Connector, Double, Double)
 Places the part on the specified host.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
HostId
 Returns the identifier of the host.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
FabricationHostedInfo Class
Autodesk.Revit.DB Namespace